app/controllers/api/boards_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
SELECT "pins".* FROM "pins" WHERE "pins"."board_id" = $1  [["board_id", 41]]
INSERT INTO "boards" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 68], ["name", "Patterns"], ["created_at", "2021-02-17 18:10:26.429357"], ["updated_at", "2021-02-17 18:10:26.429357"]]
---
    def create
        @board = Board.new(board_params)
        @user = User.find(@board.user_id)
        @boards = Board.where(user_id: @board.user_id).includes(:pins).to_a
        @ownerPins = @user.pins.includes(photo_attachment: :blob).to_a
        @pins = []
        if @board.save

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
SELECT "pins".* FROM "pins" WHERE "pins"."board_id" = $1  [["board_id", 41]]
UPDATE "boards" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "boards"."id" = $4  [["name", "Sewing"], ["description", ""], ["updated_at", "2021-02-17 18:10:39.122387"], ["id", 41]]
---
    def update
        @board = Board.find(params[:id])
        @user = User.find(@board.user_id)
        @boards = Board.where(user_id: @board.user_id).includes(:pins).to_a
        @pins = @user.pins.includes(photo_attachment: :blob).to_a
        if @board && @board.update_attributes(board_params)

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
---
    def destroy
        @board = Board.find(params[:id])
        @pins = @board.pins.includes(photo_attachment: :blob).to_a

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = $1  [["user_id", 68]]
SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = $1  [["user_id", 68]]
SELECT "pins".* FROM "pins" WHERE "pins"."board_id" = $1  [["board_id", 38]]
---
    def show
        @board = Board.find_by(id: params[:id])
        @user = User.find(@board.user_id)
        @boards = Board.where(user_id: @board.user_id).includes(:pins).to_a
        @pins = @user.pins.includes(photo_attachment: :blob).to_a