app/controllers/api/pins_controller.rb

    def create
        @pin = Pin.new(pin_params)
        if @pin.save
            debugger
            if params[:board_id] == ""
                @board = Board.create!({user_id: @pin.user_id, name: "Quick Saves", description: "", owner_email: @pin.owner_email})
                BoardsPin.create!(board_id: @board.id, pin_id: @pin.id)
            else
                @board = Board.find(params[:board_id])
---
INSERT INTO "pins" ("pin_url", "user_id", "created_at", "updated_at", "board_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["pin_url", "www.pinandneedle.com"], ["user_id", 68], ["created_at", "2021-02-19 14:51:24.452843"], ["updated_at", "2021-02-19 14:51:24.452843"], ["board_id", 41]]
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]

    def update
        @pin = Pin.find_by(id: params[:id])
        if @pin && params[:pin][:delete_boardsPin]
            @boardsPins = BoardsPin.where(pin_id: @pin.id, board_id: params[:pin][:board_id])
            BoardsPin.delete(@boardsPins[0][:id])
            @user = User.find(params[:pin][:userId])
            @board = Board.find(params[:pin][:board_id])
            @boards = Board.where(user_id: @user.id).includes(:pins).to_a
            @pins = @user.pins.includes(photo_attachment: :blob).to_a
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def show
        @pin = Pin.find_by(id: params[:id])
        @user = User.find(@pin.user_id)
        @boards = Board.where(user_id: @pin.user_id).includes(:pins).to_a
        @pins = @user.pins.includes(photo_attachment: :blob).to_a

        if params[:board_id]

            @board = Board.find(params[:pin][:board_id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]