app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demouser@email.com"], ["LIMIT", 1]]
SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = $1  [["user_id", 68]]
SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = $1  [["user_id", 68]]
---
    def create
        @user = User.find_user_by_credentials(params[:user][:email], params[:user][:password]);
        if @user
            login(@user)
            @boards = Board.where(user_id: @user.id).includes(:pins).to_a