app/controllers/api/users_controller.rb

    def show
        @user = User.find(params[:id])
        @boards = Board.where(user_id: params[:id]).includes(:pins).to_a
        @pins = []
        if @boards
            @boards.each do |board|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = $1  [["user_id", 68]]
SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = $1  [["user_id", 68]]
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]