app/views/api/users/_user.json.jbuilder

SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = $1  [["user_id", 68]]
---
json.boards do
    user.boards.each do |board|

SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = $1  [["user_id", 68]]
---
            json.extract! board, :id, :user_id, :name, :description, :created_at, :owner_email
            json.pins board.pins.map { |pin| {id: pin.id, title: pin.title, pin_url: pin.pin_url, description: pin.description, user_id: pin.user_id, owner_email: pin.owner_email, photoUrl: url_for(pin.photo)}}