app/views/api/users/show.json.jbuilder

json.boards do
    @user.boards.each do |board|
---
SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = $1  [["user_id", 68]]

            json.extract! board, :id, :user_id, :name, :description, :created_at, :owner_email
            json.pins board.pins.map { |pin| {id: pin.id, photoUrl: url_for(pin.photo)}}
---
SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = $1  [["user_id", 68]]