app/views/api/boards/show.json.jbuilder

SELECT "pins".* FROM "pins" WHERE "pins"."board_id" = $1  [["board_id", 38]]
---
                    json.extract! board, :id, :name, :user_id, :owner_email
                    json.pins board.pins.map { |pin| {id: pin.id, photoUrl: url_for(pin.photo)}}