app/models/user.rb

    def self.find_user_by_credentials(email, password)
        @user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demouser@email.com"], ["LIMIT", 1]]