app/views/api/pins/show.json.jbuilder

        json.boards do
            @pin.user.boards.each do |board|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]